app/views/gifts/index.html.haml

SELECT `groups`.* FROM `groups`
---
          .gifts__body__upper__box__name
            = gift.group_id
          .gifts__body__upper__box__content