app/controllers/gifts_controller.rb

  def index
    @gift = Gift.new
    @gifts = Gift.all.order("id DESC")
    gift = [].take(10)
    @group = Group.all
---
SELECT `gifts`.* FROM `gifts` ORDER BY id DESC
SELECT `groups`.* FROM `groups`

  def create
    @gift = Gift.create(gift_params)
---
INSERT INTO `gifts` (`content`, `image`, `group_id`, `created_at`, `updated_at`) VALUES ('test2', 'fruit-932745_1920.jpg', 6, '2019-12-27 13:20:37', '2019-12-27 13:20:37')